"""
по мотивам книги Абдрахманов М.И. - Python. Визуализация данных - 2020
если вдумчиво подойти то все работает, объснено подробненько.
"""

import matplotlib.pyplot as plt
# import numpy as np

# x = np.linspace(0, 10, 50)
# y = x

# plt.title("Линейная зависимость y = x") # заголовок
# plt.xlabel("x") # ось абсцисс
# plt.ylabel("y") # ось ординат
# plt.grid()      # включение отображение сетки
# plt.plot(x, y, 'r--')  # построение графика

# # plt.plot([1, 2, 3, 4, 5], [1, 2, 3, 4, 5])
plt.plot([1, 7, 3, 5, 11, 1])
plt.grid()      # включение отображение сетки
plt.show()